<center>
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/Logos/organization_logo/organization_logo.png" width="1000" alt="cognitiveclass.ai logo"  />
</center>

# Assignment: Exploratory Data Analysis with SQL

Estimated time needed: 60 minutes

# Introduction

Using this R notebook you will perform exploratory data analysis tasks using SQL queries with the RODBC R package. You will not be graded here, but you will be asked to present some of these results in your final assignment, where you will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your Db2 connection

Load the 'RODBC' library, and use the 'odbcConnect( )' function as you did in the previous lab to establish the connection to your Db2 assets.\
Provided you successfully loaded your data into the tables in that lab, you are now ready to start running SQL queries using the RODBC library as you did in Course 3.

In [1]:
library(RODBC)

In [2]:
# provide your solution here
dsn_driver <- "{IBM DB2 ODBC Driver}"
dsn_database <- "bludb"            # e.g. "bludb"
dsn_hostname <- "55fbc997-9266-4331-afd3-888b05e734c0.bs2io90l08kqb1od8lcg.databases.appdomain.cloud" # e.g "54a2f15b-5c0f-46df-8954-.databases.appdomain.cloud"
dsn_port <- "31929"   # e.g. "32733" 
dsn_protocol <- "TCPIP"            # i.e. "TCPIP"
dsn_uid <- "hqd74609"        # e.g. "zjh17769"
dsn_pwd <- "xjxeRZKZkTZftWJV"      # e.g. "zcwd4+8gbq9bm5k4"  
dsn_security <- "ssl"

In [3]:
conn_path <- paste("DRIVER=",dsn_driver,
                  ";DATABASE=",dsn_database,
                  ";HOSTNAME=",dsn_hostname,
                  ";PORT=",dsn_port,
                  ";PROTOCOL=",dsn_protocol,
                  ";UID=",dsn_uid,
                  ";PWD=",dsn_pwd,
                  ";SECURITY=",dsn_security,        
                    sep="")
conn <- odbcDriverConnect(conn_path)
conn

RODBC Connection 1
Details:
  case=nochange
  DRIVER={IBM DB2 ODBC DRIVER}
  UID=hqd74609
  PWD=******
  DATABASE=bludb
  HOSTNAME=55fbc997-9266-4331-afd3-888b05e734c0.bs2io90l08kqb1od8lcg.databases.appdomain.cloud
  PORT=31929
  PROTOCOL=TCPIP
  SECURITY=SSL

In [4]:
#View database and driver information
sql.info <- sqlTypeInfo(conn)
conn.info <- odbcGetInfo(conn)
conn.info["DBMS_Name"]
conn.info["DBMS_Ver"]
conn.info["Driver_ODBC_Ver"]

       DBMS_Name
"DB2/LINUXX8664"

    DBMS_Ver
"11.05.0600"

Driver_ODBC_Ver
        "03.51"

In [5]:
seoul_bike_sharing_dset<- sqlFetch(conn, "SEOUL_BIKE_SHARING")
head(seoul_bike_sharing_dset,2)
tail(seoul_bike_sharing_dset,2)
nrow(seoul_bike_sharing_dset)

  DATE       RENTED_BIKE_COUNT HOUR TEMPERATURE HUMIDITY WIND_SPEED VISIBILITY
1 01/12/2017 254               0    -5.2        37       2.2        2000
2 01/12/2017 204               1    -5.5        38       0.8        2000
  DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL SNOWFALL SEASONS HOLIDAY
1 -17.6                 0               0        0        Winter  No Holiday
2 -17.6                 0               0        0        Winter  No Holiday
  FUNCTIONING_DAY
1 Yes
2 Yes

     DATE       RENTED_BIKE_COUNT HOUR TEMPERATURE HUMIDITY WIND_SPEED
8464 30/11/2018 712               22   2.1         41       1.0
8465 30/11/2018 584               23   1.9         43       1.3
     VISIBILITY DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL SNOWFALL SEASONS
8464 1859       -9.8                  0               0        0        Autumn
8465 1909       -9.3                  0               0        0        Autumn
     HOLIDAY    FUNCTIONING_DAY
8464 No Holiday Yes
8465 No Holiday Yes

[1] 8465

In [10]:
world_cities_dset<- sqlFetch(conn, "WORLD_CITIES")
head(world_cities_dset,2)
nrow(world_cities_dset)

  CITY    CITY_ASCII LAT   LNG    COUNTRY   ISO2 ISO3 ADMIN_NAME CAPITAL
1 Tokyo   Tokyo      35.68 139.69 Japan     JP   JPN  Tōkyō      primary
2 Jakarta Jakarta    -6.21 106.84 Indonesia ID   IDN  Jakarta    primary
  POPULATION ID
1 37977000   1392685764
2 34540000   1360771077

[1] 26569

In [12]:
bike_sharing_systems_dset<- sqlFetch(conn, "BIKE_SHARING_SYSTEMS")
head(bike_sharing_systems_dset,2)
nrow(bike_sharing_systems_dset)

  COUNTRY   CITY    SYSTEM BICYCLES
1 Albania   Tirana  NA     200
2 Argentina Mendoza NA      40

[1] 480

In [13]:
cities_weather_forecast_dset<- sqlFetch(conn,"CITIES_WEATHER_FORECAST")
head(cities_weather_forecast_dset,2)
nrow(cities_weather_forecast_dset)

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
2 Seoul Clear   10000      11.48  9.81    11.48    1016     48       1.25
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 2021-04-16 12:00:00
2 142      Spring 2021-04-16 15:00:00

[1] 160

## Task 1 - Record Count

#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [7]:
# provide your solution here
seoul_bike_sharing_dset<- sqlFetch(conn, "SEOUL_BIKE_SHARING")
nrow(seoul_bike_sharing_dset)
tail(seoul_bike_sharing_dset,1)

[1] 8465

     DATE       RENTED_BIKE_COUNT HOUR TEMPERATURE HUMIDITY WIND_SPEED
8465 30/11/2018 584               23   1.9         43       1.3
     VISIBILITY DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL SNOWFALL SEASONS
8465 1909       -9.3                  0               0        0        Autumn
     HOLIDAY    FUNCTIONING_DAY
8465 No Holiday Yes

## Task 2 - Operational Hours

#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [28]:
# provide your solution here
sqlQuery ( conn, "SELECT count(HOUR) from SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT != '0';")
sqlQuery ( conn, "SELECT count(HOUR) from SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT = '0';")
sqlQuery ( conn, "SELECT COUNT (DISTINCT(DATE)) from SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT!= '0';")
sqlQuery ( conn, "SELECT COUNT (DISTINCT(DATE)) from SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT= '0';")

  1
1 8465

  1
1 0

  1
1 353

  1
1 0

## Task 3 - Weather Outlook

#### Query the the weather forecast for Seoul over the next 3 hours.

Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [29]:
# provide your solution here
cities_weather_forecast_dset<- sqlFetch(conn,"CITIES_WEATHER_FORECAST")
head(cities_weather_forecast_dset,2)

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
2 Seoul Clear   10000      11.48  9.81    11.48    1016     48       1.25
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 2021-04-16 12:00:00
2 142      Spring 2021-04-16 15:00:00

## Task 4 - Seasons

#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [30]:
# provide your solution here
sqlQuery ( conn, "SELECT DISTINCT(SEASONS) from SEOUL_BIKE_SHARING;")

  SEASONS
1 Autumn
2 Spring
3 Summer
4 Winter

## Task 5 - Date Range

#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [51]:
# provide your solution here
sqlQuery ( conn, "SELECT MIN(DATE) as FIRST_DATE, MAX(DATE) as LAST_DATE from SEOUL_BIKE_SHARING;")

  FIRST_DATE LAST_DATE
1 01/01/2018 31/12/2017

## Task 6 - Subquery - 'all-time high'

#### determine which date and hour had the most bike rentals.

### Solution 6

In [59]:
# provide your solution here
sqlQuery (conn, "SELECT MAX(RENTED_BIKE_COUNT) from SEOUL_BIKE_SHARING;")
sqlQuery ( conn, "SELECT DATE,HOUR,RENTED_BIKE_COUNT from SEOUL_BIKE_SHARING where RENTED_BIKE_COUNT =(SELECT MAX(RENTED_BIKE_COUNT) 
from SEOUL_BIKE_SHARING) ORDER BY RENTED_BIKE_COUNT DESC LIMIT 15 ;")

  1
1 3556

  DATE       HOUR RENTED_BIKE_COUNT
1 19/06/2018 18   3556

In [83]:
query2 <- "SELECT HOUR,DATE,RENTED_BIKE_COUNT 
from SEOUL_BIKE_SHARING 
where RENTED_BIKE_COUNT = (SELECT MAX(RENTED_BIKE_COUNT) from SEOUL_BIKE_SHARING )"
view <-sqlQuery(conn, query2)
view

  HOUR DATE       RENTED_BIKE_COUNT
1 18   19/06/2018 3556

## Task 7 - Hourly popularity and temperature by season

#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [99]:
sqlQuery(conn, "select SEASONS, AVG(RENTED_BIKE_COUNT) AS AVG_RBC,AVG(TEMPERATURE) AS AVG_TEMP from SEOUL_BIKE_SHARING  GROUP BY SEASONS ORDER BY
AVG_RBC;") 
sqlQuery(conn, "select SEASONS, HOUR, AVG(RENTED_BIKE_COUNT) AS AVG_RBC,AVG(TEMPERATURE) AS AVG_TEMP from SEOUL_BIKE_SHARING GROUP BY SEASONS, 
HOUR ORDER BY AVG_RBC LIMIT 6;")

  SEASONS AVG_RBC AVG_TEMP
1 Winter   225    -2.540463
2 Spring   746    13.021389
3 Autumn   924    13.821167
4 Summer  1034    26.587274

  SEASONS HOUR AVG_RBC AVG_TEMP
1 Winter  4     50     -4.564444
2 Winter  5     51     -4.803333
3 Winter  3     77     -4.363333
4 Winter  6     92     -5.031111
5 Spring  4    108      9.694444
6 Spring  5    116      9.453333

## Task 8 - Rental Seasonality

#### Find the average hourly bike count during each season.

Also include the minimum, maximum, and standard deviation of the hourly bike count for each season.

### Solution 8

In [69]:
# provide your solution here
sqlQuery(conn, "select MIN(RENTED_BIKE_COUNT) as RENTED_BIKE_COOUNT_MIN,MAX(RENTED_BIKE_COUNT) AS MAX,AVG(RENTED_BIKE_COUNT) AS AVG_SEA,
STDDEV(RENTED_BIKE_COUNT) AS STD_DV,MEDIAN(RENTED_BIKE_COUNT) AS MEDIAN,SUM(RENTED_BIKE_COUNT) AS SUM,COUNT(RENTED_BIKE_COUNT)
AS COUNT,AVG(RENTED_BIKE_COUNT)/AVG(HOUR) AS AVG_RBC_HR,SEASONS from SEOUL_BIKE_SHARING GROUP BY SEASONS ORDER BY AVG_SEA;")

  RENTED_BIKE_COOUNT_MIN MAX  AVG_SEA STD_DV   MEDIAN SUM     COUNT AVG_RBC_HR
1 3                       937  225    150.3374 203.0   487169 2160  20
2 2                      3251  746    618.5247 599.0  1611909 2160  67
3 2                      3298  924    617.3885 856.0  1790002 1937  84
4 9                      3556 1034    690.0884 905.5  2283234 2208  94
  SEASONS
1 Winter
2 Spring
3 Autumn
4 Summer

In [75]:
# provide your solution here
sqlQuery(conn, "select MIN(RENTED_BIKE_COUNT) as RENTED_BIKE_COOUNT_MIN,MAX(RENTED_BIKE_COUNT) AS MAX,AVG(RENTED_BIKE_COUNT) 
AS AVG,STDDEV(RENTED_BIKE_COUNT) AS STD_DV,MEDIAN(RENTED_BIKE_COUNT) AS MEDIAN,SUM(RENTED_BIKE_COUNT) AS SUM,COUNT(RENTED_BIKE_COUNT) 
AS COUNT,AVG(RENTED_BIKE_COUNT)/AVG(HOUR) AS AVGRBC_HR,(SELECT DISTINCT(SEASONS) from SEOUL_BIKE_SHARING WHERE SEASONS = 'Autumn')
from SEOUL_BIKE_SHARING WHERE SEASONS = 'Autumn';")

  RENTED_BIKE_COOUNT_MIN MAX  AVG STD_DV   MEDIAN SUM     COUNT AVGRBC_HR
1 2                      3298 924 617.3885 856    1790002 1937  84
  SEASONS
1 Autumn

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality

#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?

Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [87]:
# provide your solution here
sqlQuery(conn, "select SEASONS, AVG(TEMPERATURE) as TEMP_AVG, AVG(HUMIDITY) AS HUMIDITY_AVG, AVG(WIND_SPEED) AS WIND_SPEED_AVG, AVG(VISIBILITY)
AS VISIBILITY_AVG , AVG(SOLAR_RADIATION) AS SOLAR_RADT_AVG, AVG(RAINFALL) AS RAINFALL_AVG, AVG(SNOWFALL) AS SNOWFALL_AVG, 
AVG(DEW_POINT_TEMPERATURE) AS DP_TEMP_AVG,AVG(RENTED_BIKE_COUNT) AS BIKE_COUNT_AVG from  SEOUL_BIKE_SHARING GROUP BY SEASONS ORDER BY
BIKE_COUNT_AVG LIMIT 10;")

  SEASONS TEMP_AVG  HUMIDITY_AVG WIND_SPEED_AVG VISIBILITY_AVG SOLAR_RADT_AVG
1 Winter  -2.540463 49           1.922685       1445           0.2981806
2 Spring  13.021389 58           1.857778       1240           0.6803009
3 Autumn  13.821167 59           1.492101       1558           0.5227827
4 Summer  26.587274 64           1.609420       1501           0.7612545
  RAINFALL_AVG SNOWFALL_AVG DP_TEMP_AVG BIKE_COUNT_AVG
1 0.03282407   0.24750000   -12.416667   225
2 0.18694444   0.00000000     4.091389   746
3 0.11765617   0.06350026     5.150594   924
4 0.25348732   0.00000000    18.750136  1034

In [73]:
sqlQuery(conn, "select AVG(TEMPERATURE) as TEMP_AVG, AVG(HUMIDITY) AS HUMIDITY_AVG, AVG(WIND_SPEED) AS WIND_SPEED_AVG, AVG(VISIBILITY) 
AS VISIBILITY_AVG , AVG(SOLAR_RADIATION) AS SOLAR_RADT_AVG, AVG(RAINFALL) AS RAINFALL_AVG, AVG(SNOWFALL) AS SNOWFALL_AVG, 
AVG(DEW_POINT_TEMPERATURE) AS DP_TEMP_AVG,AVG(RENTED_BIKE_COUNT) AS BIKE_COUNT_AVG,(SELECT DISTINCT(SEASONS) 
from SEOUL_BIKE_SHARING WHERE SEASONS = 'Autumn') from  SEOUL_BIKE_SHARING WHERE SEASONS = 'Autumn'; ")

  TEMP_AVG HUMIDITY_AVG WIND_SPEED_AVG VISIBILITY_AVG SOLAR_RADT_AVG
1 13.82117 59           1.492101       1558           0.5227827
  RAINFALL_AVG SNOWFALL_AVG DP_TEMP_AVG BIKE_COUNT_AVG SEASONS
1 0.1176562    0.06350026   5.150594    924            Autumn

## Task 10 - Total Bike Count and City Info for Seoul

#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.

Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [101]:
# provide your solution here
sqlQuery(conn, "SELECT* FROM WORLD_CITIES, BIKE_SHARING_SYSTEMS WHERE WORLD_CITIES.CITY = BIKE_SHARING_SYSTEMS.CITY LIMIT 6;")
sqlQuery(conn, "SELECT  CITY,COUNTRY,BICYCLES FROM  BIKE_SHARING_SYSTEMS  LIMIT 1;")
sqlQuery(conn, "SELECT  CITY,COUNTRY,LAT,LNG,POPULATION FROM WORLD_CITIES  LIMIT 1;")

  CITY        CITY_ASCII  LAT    LNG    COUNTRY      ISO2 ISO3 ADMIN_NAME
1 Łódź        Lodz         51.77  19.45 Poland       PL   POL  Łódzkie
2 Mumbai      Mumbai       18.96  72.83 India        IN   IND  Mahārāshtra
3 Shanghai    Shanghai     31.16 121.46 China        CN   CHN  Shanghai
4 São Paulo   Sao Paulo   -23.55 -46.63 Brazil       BR   BRA  São Paulo
5 Seoul       Seoul        37.58 127.00 Korea, South KR   KOR  Seoul
6 Mexico City Mexico City  19.43 -99.13 Mexico       MX   MEX  Ciudad de México
  CAPITAL POPULATION ID         COUNTRY.1   CITY.1      SYSTEM
1 admin     690422   1616832750 Poland      Łódź        3 Gen. nextbike
2 admin   23355000   1356226629 India       Mumbai      NA
3 admin   22120000   1156073548 China       Shanghai    Forever Bicycle
4 admin   22046000   1076532519 Brazil      São Paulo   tembici
5 primary 21794000   1410836482 South Korea Seoul       NA
6 primary 20996000   1484247881 Mexico      Mexico City 3 Gen. Clear CC
  BICYCLES
1  1490
2    NA
3 19165
4   600
5 20000
6  6500

  CITY   COUNTRY BICYCLES
1 Tirana Albania 200

  CITY  COUNTRY LAT   LNG    POPULATION
1 Tokyo Japan   35.68 139.69 37977000

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system

#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.

Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [78]:
# provide your solution here
sqlQuery(conn, "SELECT B.CITY,B.COUNTRY, LAT,LNG,POPULATION , B.BICYCLES FROM  WORLD_CITIES, BIKE_SHARING_SYSTEMS B LIMIT 4;")

  CITY   COUNTRY LAT   LNG    POPULATION BICYCLES
1 Tirana Albania 35.68 139.69 37977000   200
2 Tirana Albania -6.21 106.84 34540000   200
3 Tirana Albania 28.66  77.23 29617000   200
4 Tirana Albania 18.96  72.83 23355000   200

In [80]:
sqlQuery(conn, "SELECT B.CITY,B.COUNTRY, LAT,LNG,POPULATION , B.BICYCLES FROM  WORLD_CITIES, BIKE_SHARING_SYSTEMS B 
WHERE B.BIYCLES>=15000 AND <=20000 LIMIT 6;")

[1] "42601 -104 [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token \"<=\" was found following \"B.BIYCLES>=15000 AND\".  Expected tokens may include:  \"<space>\".  SQLSTATE=42601\n"
[2] "[RODBC] ERROR: Could not SQLExecDirect 'SELECT B.CITY,B.COUNTRY, LAT,LNG,POPULATION , B.BICYCLES FROM  WORLD_CITIES, BIKE_SHARING_SYSTEMS B \nWHERE B.BIYCLES>=15000 AND <=20000 LIMIT 6;'"

In [98]:
sqlQuery(conn, "SELECT B.CITY, B.COUNTRY, LAT, LNG, POPULATION, B.BICYCLES FROM WORLD_CITIES, BIKE_SHARING_SYSTEMS B  
           WHERE B.BICYCLES = (SELECT (B.BICYCLES>15000 ) FROM BIKE_SHARING_SYSTEMS B) LIMIT 6;")

     CITY COUNTRY LAT LNG POPULATION BICYCLES

In [ ]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>

## Contributor(s)

<h4> Yan Luo, Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description                  |
| ---------- | ------- | ------------- | ----------------------------------- |
| 2021-05-04 | 0.2     | Jeff Grossman | Finalize                            |
| 2021-04-22 | 0.2     | Jeff Grossman | Update as per peer review           |
| 2021-04-10 | 0.2     | Jeff Grossman | Add data sources and implicit joins |
| 2021-04-05 | 0.1     | Jeff Grossman | Start content creation              |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>